Backend/artillery.yml
config:
  target: "http://localhost:8999"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Normal"
    - duration: 60
      arrivalRate: 10
      name: "Busy day"
  defaults:
    headers:
      Content-Type: "application/json"
  variables:
    userEmail: "loaduser@test.com"
    userPassword: "secret123"

scenarios:
  - name: "Full billing flow"
    weight: 70
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "{{ userPassword }}"
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
      - think: 1
      - post:
          url: "/api/customers"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            name: "Load Customer"
            phone: "9123456789"
      - post:
          url: "/api/billing/save"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            items:
              - productName: "Load Item A"
                quantity: 2
                unit: "piece"
                price: 100
              - productName: "Load Item B"
                quantity: 1
                unit: "kg"
                price: 50
            paymentMethod: "cash"
            paymentStatus: "paid"
      - think: 2
      - get:
          url: "/api/dashboard/summary"
          headers:
            Authorization: "Bearer {{ accessToken }}"
      - get:
          url: "/api/search?q=Load"
          headers:
            Authorization: "Bearer {{ accessToken }}"

  - name: "Read-only dashboard"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "{{ userPassword }}"
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
      - get:
          url: "/api/dashboard/summary"
          headers:
            Authorization: "Bearer {{ accessToken }}"
      - get:
          url: "/api/bills"
          headers:
            Authorization: "Bearer {{ accessToken }}"
      - get:
          url: "/api/analytics/top-products"
          headers:
            Authorization: "Bearer {{ accessToken }}"